# FabricationItemFile Properties

---
The FabricationItemFile type exposes the following members.
| Name| Description
---|---|---
| Identifier|  The string identifier for the item file. This string is unique and can be used to compare whether fabrication item files are the same file.
| IsUsed|  Checks to see if the item file is already in use in the project.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FabricationItemFile Class
Autodesk.Revit.DB Namespace